{
  "title": "Aviso de Cookies",
  "content": [
    "<0>Aviso de Cookies</0>",
    "Este Aviso de Cookies explica cómo el sitio web de Omar BR utiliza cookies y tecnologías similares para recopilar y almacenar información cuando visitas nuestro sitio web.",
    "",
    "<1>¿Qué son las Cookies?</1>",
    "Las cookies son pequeños archivos de texto que se colocan en tu dispositivo cuando visitas un sitio web. Permiten que el sitio web recuerde tus acciones y preferencias con el tiempo, brindando una experiencia de navegación más personalizada.",
    "",
    "<1>Cómo Utilizamos las Cookies:</1>",
    "Utilizamos cookies para los siguientes propósitos:",
    "- Asegurar el correcto funcionamiento del sitio web.",
    "- Analizar el tráfico y patrones de uso del sitio web a través de Google Analytics.",
    "- Recordar tus preferencias (por ejemplo, idioma, ajustes de consentimiento) durante tu visita.",
    "",
    "<1>Cookies de Terceros:</1>",
    "Podemos utilizar servicios de terceros, como Google Analytics, que también pueden colocar cookies en tu dispositivo para recopilar información anónima sobre tus interacciones con el sitio web.",
    "",
    "<1>Tus Opciones de Cookies:</1>",
    "Puedes optar por aceptar o rechazar las cookies a través de la configuración de tu navegador. La mayoría de los navegadores web aceptan automáticamente las cookies, pero generalmente puedes modificar la configuración de tu navegador para rechazar las cookies si lo prefieres. Sin embargo, esto puede evitar que aproveches al máximo el sitio web.",
    "",
    "<1>Cambios en el Aviso de Cookies:</1>",
    "Podemos actualizar este Aviso de Cookies periódicamente para reflejar cambios en nuestras prácticas o por otras razones operativas, legales o regulatorias. La versión más actualizada estará siempre disponible en esta página.",
    "",
    "Al utilizar el sitio web de Omar BR, das tu consentimiento para el uso de cookies y aceptas los términos de este Aviso de Cookies.",
    "",
    "Toma en cuenta que estos ejemplos se proporcionan como punto de partida y deben revisarse y adaptarse para que se ajusten a tu sitio web específico y a los requisitos legales locales. Es esencial consultar con profesionales legales para asegurarse de que tu Aviso de Privacidad, Términos y Condiciones y Aviso de Cookies cumplan con las leyes y regulaciones aplicables.",
    "",
    "<2>Última Actualización: 16 de julio de 2023</2>"
  ]
}
