{
  "title": "Política de Privacidad",
  "content": [
    "<0>Política de Privacidad</0>",
    "<1>Información que Recopilamos:</1>",
    "Cuando visitas el sitio web de Omar BR, podemos recopilar la siguiente información:",
    "- Tu nombre (proporcionado de manera voluntaria a través del formulario de contacto).",
    "- Tu dirección de correo electrónico (proporcionada de manera voluntaria a través del formulario de contacto).",
    "- Cualquier otra información que elijas compartir con nosotros a través del formulario de contacto.",
    "",
    "<1>Cómo Utilizamos tu Información:</1>",
    "Utilizamos la información recopilada para los siguientes propósitos:",
    "- Responder a tus consultas y mensajes enviados a través del formulario de contacto.",
    "- Mejorar nuestro sitio web y servicios.",
    "- Monitorear el tráfico y uso del sitio web mediante Google Analytics (datos anonimizados).",
    "",
    "<1>Seguridad de los Datos:</1>",
    "Tomamos en serio la seguridad de los datos e implementamos medidas técnicas y organizativas apropiadas para proteger tu información personal contra el acceso no autorizado, pérdida o alteración.",
    "",
    "<1>Servicios de Terceros:</1>",
    "Utilizamos Google Analytics para analizar el tráfico y el uso del sitio web. Google Analytics puede recopilar datos anónimos sobre tus interacciones con el sitio web. Consulta la Política de Privacidad de Google para obtener más información sobre cómo manejan tus datos.",
    "",
    "<1>Conservación de los Datos:</1>",
    "Conservaremos tu información personal durante el tiempo necesario para cumplir con los propósitos establecidos en esta Política de Privacidad, a menos que se requiera o permita un período de retención más prolongado según lo establecido por la ley.",
    "",
    "<1>Cambios en la Política de Privacidad:</1>",
    "Podemos actualizar esta Política de Privacidad periódicamente para reflejar cambios en nuestras prácticas o por otras razones operativas, legales o regulatorias. La versión más actualizada estará siempre disponible en esta página.",
    "",
    "<2>Última Actualización: 16 de julio de 2023</2>"
  ]
}
