{
  "title": "Mis Proyectos",
  "other-projects": "Otros Proyectos",
  "more-projects": "Más Proyectos",
  "in-development": "En Desarrollo",
  "open-source-project": "¡Este proyecto es open source! Puedes ver el código en su repositorio de GitHub dando click al ícono debajo.",

  "david-camporredondo": {
    "title": "David Camporredondo",
    "subtitle": "Portafolio de un Músico",
    "description": "David es un guitarrista mexicano que ofrece clases en línea de guitarra, piano, y teoría musical. Su página muestra sus videos de YouTube, su experiencia como músico y maestro, y el contenido de sus clases.",
    "architecture": "Este sitio web fue desarrollado con NextJS, ReactJS y TailwindCSS. Tiene integrado Google Analytics para monitorear el tráfico de usuarios, y un formulario de contacto que le envía un correo a David usando Nodemailer, y guarda la información en un SpreadSheet usando el API de Google."
  },
  "wobsgg": {
    "title": "WobsGG",
    "subtitle": "eCommerce de Controles",
    "description": "WobsGG es un negocio dedicado a la modificación estética e interna de controles de Nintendo GameCube para Smash. Hecha con NextJS y Saleor, esta tienda online le permite a los clientes comprar el control perfecto para ellos, o pueden guardar su producto favorito o compartirlo con sus amigos. El admin tiene la libertad de administrar sus productos, órdenes, y más, a través de un dashboard personal.",
    "architecture": "Este proyecto aún está en desarrollo, pero el frontend siendo desarrollado con NextJS, TypeScript, MUI, y GraphQL, mientras que el backend será Saleor con PostgreSQL y GraphQL."
  },
  "auth-passport-jwt": {
    "title": "JWT Auth",
    "subtitle": "Autenticación Segura (JWT)",
    "description": "Aplicación fullstack ejemplificando cómo agregar autenticación JWT segura con sesión persistente a una app de ReactJS con un servidor de NodeJS usando ExpressJS.",
    "architecture": "El frontend de esta aplicación está hecho con ReactJS, manejando el estado de la app con Redux y LocalStorage para mantener una sesión persistente. En el diseño utilicé Tailwind CSS para experimentar con la simplicidad y consistencia de su sistema de diseño.<br/><br/>El backend es un servidor de ExpressJS en NodeJS actuando como API usando GraphQL, permitiendo al frontend registrar usuarios a una base de datos de MongoDB usando Passport y JWT para mantener una autenticación segura."
  },
  "ip-address-tracker": {
    "title": "Buscador de IP",
    "subtitle": "Ubicación e Info de un IP",
    "description": "Este proyecto es un ejercicio de Frontend Mentor para poner a prueba el uso de Mapas con Leaflet y APIs.",
    "architecture": "Esta app web fue desarrollada con ReactJS y CSS3, consumiendo un API pública para mostrar la información sobre una IP, incluyendo sus coordenadas geográficas, las cuales son usadas por Leaflet para mostrar la ubicación del IP en un mapa."
  },
  "omarbr": {
    "title": "OmarBR",
    "subtitle": "Mi Portafolio",
    "description": "¡Éste es el sitio que estás visitando! Es mi portafolio en donde mostraré mis proyectos, escribiré sobre mi carrera, y quizá comience un blog algún día.",
    "architecture": "Desarrollado con NextJS, ReactJS, TypeScript y CSS3, este sitio es multi-lenguaje, es amigable con el SEO, y tiene Google Analytics integrado."
  }
}
