{
  "title": "Términos de Uso",
  "content": [
    "<1>Términos de Uso</1>",
    "Bienvenido al sitio web de Omar BR. Al utilizar este sitio web, aceptas cumplir y estar sujeto a los siguientes términos y condiciones. Si no estás de acuerdo con alguna parte de estos términos, por favor, no utilices el sitio web.",
    "",
    "<1>Propiedad Intelectual:</1>",
    "Todo el contenido de este sitio web, incluyendo pero no limitado a texto, imágenes, gráficos, logotipos y software, es propiedad de Omar BR y está protegido por las leyes de derechos de autor y otras leyes de propiedad intelectual. No puedes reproducir, distribuir, modificar o crear obras derivadas de ninguna parte de este sitio web sin nuestro consentimiento previo por escrito.",
    "",
    "<1>Descargo de Responsabilidad:</1>",
    "La información y materiales proporcionados en este sitio web son solo para propósitos informativos generales. Aunque nos esforzamos por mantener el contenido preciso y actualizado, no ofrecemos ninguna garantía o representación de ningún tipo, expresa o implícita, sobre la integridad, precisión, confiabilidad, idoneidad o disponibilidad del sitio web o la información, productos, servicios o gráficos relacionados contenidos en el sitio web para cualquier propósito. Cualquier confianza que deposites en dicha información es estrictamente bajo tu propio riesgo.",
    "",
    "<1>Formulario de Contacto:</1>",
    "Al utilizar el formulario de contacto en este sitio web, aceptas proporcionar información precisa y veraz. No debes utilizar el formulario de contacto para enviar correo no deseado, solicitudes o cualquier forma de mensajes molestos u ofensivos. Nos reservamos el derecho de bloquear o denunciar cualquier uso abusivo del formulario de contacto.",
    "",
    "<1>Limitación de Responsabilidad:</1>",
    "En ningún caso, Omar BR será responsable por cualquier pérdida o daño, incluyendo, pero no limitado a, pérdida o daño indirecto o consecuente, o cualquier pérdida o daño que surja, ya sea por pérdida de datos o de beneficios, derivados del uso de este sitio web.",
    "",
    "<1>Enlaces Externos:</1>",
    "Este sitio web puede contener enlaces a sitios web externos que no están controlados por Omar BR. No respaldamos ni asumimos ninguna responsabilidad por el contenido o las prácticas de estos sitios web. Tu uso de cualquier sitio web externo está sujeto a sus respectivos términos de uso y políticas de privacidad.",
    "",
    "<1>Ley Aplicable:</1>",
    "Estos términos y condiciones están regidos y serán interpretados de acuerdo con las leyes de [Tu País/Estado], y cualquier disputa relacionada con estos términos y condiciones estará sujeta a la jurisdicción exclusiva de los tribunales de [Tu País/Estado].",
    "",
    "<1>Cambios en los Términos de Uso:</1>",
    "Nos reservamos el derecho de actualizar o modificar estos términos y condiciones en cualquier momento sin previo aviso. Al continuar utilizando este sitio web después de que los cambios entren en vigencia, aceptas quedar sujeto a los términos y condiciones revisados.",
    "",
    "<2>Última Actualización: 16 de julio de 2023</2>"
  ]
}
